# Напишите программу, которая определяет, является число четным или нечетным.
x = int(input())
if x%2:
    print("Нечетное")
else:
    print("Четное")
