#Напишите программу, которая считывает целое положительное число n, n ∈ [1;9],
# и выводит значение числа n+nn+nnn.
num = int(input())
print(num + num*11 + num*111)

# n = input()
# print(int(n) + int(n * 2) + int(n * 3))

# n = int(input())
# print(n + (n*10+n) + (n*100+n*10+n))

# num*123
