# Дан сотовый телефон в формате +71234567890 (11 цифр).
# Извлеките 3 цифры, являющиеся кодом оператора (которые идут после +7)
#a = input()
#start = a.index('+7')
#print(a[start+2:start+5])

a = input()
print(a[2:5])


